podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USB0_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "USB0_MKL82Z7" ?>
         <?forcedBlockWidth "32" ?>
         <name>USB0</name>
         <description>USB OTG Controller</description>
         <groupName>USB</groupName>
         <headerStructName>USB</headerStructName>
         <baseAddress>0x40072000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x80</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0xC0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x114</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x124</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x154</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <?width "8" ?>
            <offset>0x15C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PERID</name>
               <description>Peripheral ID Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x4</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Peripheral Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDCOMP</name>
               <description>Peripheral ID Complement Register</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0xFB</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>NID</name>
                     <description>Ones complement of peripheral identification bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REV</name>
               <description>Peripheral Revision Register</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x33</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>Revision</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDINFO</name>
               <description>Peripheral Additional Info Register</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>IEHOST</name>
                     <description>USB operating mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Device Mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Host mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTGISTAT</name>
               <description>OTG Interrupt Status Register\n
The OTG Interrupt Status Register records changes of the ID sense and VBUS signals\n
Only bits that have changed since the last software read are set\n
Writing a one to a bit clears the associated interrupt</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LINE_STATE_CHG</name>
                     <description>USB Line change\n
This bit is set when the USB line state changes\n
The interrupt associated with this bit can be used to detect Reset, Resume, Connect, and Data Line Pulse signaling</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="LINE_STATE_CHG" > <name>ONEMSEC</name> <description>1ms Timer expired\n
This bit is set when the 1 millisecond timer expires.\n
This bit stays asserted until cleared by software.\n
The interrupt must be serviced every millisecond to avoid losing 1msec counts</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>OTGICR</name>
               <description>OTG Interrupt Control Register\n
The OTG Interrupt Control Register enables the corresponding interrupt status bits defined in the OTG
Interrupt Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LINESTATEEN</name>
                     <description>Line State Change Interrupt\n
Enables Line State Change interrupts</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="LINESTATEEN" > <name>ONEMSECEN</name> <description>1ms Interrupt\n
Enables One Millisecond Interrupts</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>OTGSTAT</name>
               <description>OTG Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>LINESTATESTABLE</name>
                     <description>Line state stable for &gt; 1ms\n
Indicates that the internal signals that control the LINE_STATE_CHG field of OTGISTAT are stable for at least 1 millisecond.\n
First read LINE_STATE_CHG field and then read this field.\n
If this field reads as 1, then the value of LINE_STATE_CHG can be considered stable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not stable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Stable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONEMSECEN</name>
                     <description>This bit is reserved for the 1ms count, but it is not useful to software</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTGCTL</name>
               <description>OTG Control Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OTGEN</name>
                     <description>On-The-Go pull-up/down enable\n
If disabled the pull-up/down resistors are controlled according to CTL.HOST_MODE settings\n
If enabled the values in this register control the pull-up/downs</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Automatic control</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Controlled by OTCTL</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMLOW</name>
                     <description>D- Data Line pull-down enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="DMLOW" > <name>DPLOW</name> <description>D+ Data Line pull-down enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="DMLOW" > <name>DPHIGH</name> <description>D+ Data Line pullup enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ISTAT</name>
               <description>Interrupt Status Register\n
The Interrupt Status Register contains bits for each of the interrupt sources within the USB Module.\n
Each of these bits are qualified with their respective interrupt enable bits</description>
               <addressOffset>0x80</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>USBRST</name>
                     <description>USB reset\n
This bit is set when the USB Module has decoded a valid USB reset.\n
USBRST is set after a USB reset has been detected for 2.5 microseconds.\n
It is not asserted again until the USB reset condition has been removed and then reasserted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="USBRST" > <name>ERROR</name> <description>Error Status set\n
This bit is set when any of the error conditions within Error Interrupt Status (ERRSTAT) register occur.\n
The processor must then read the ERRSTAT register to determine the source of the error</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>SOFTOK</name> <description>Start Of Frame\n
This bit is set when the USB Module receives a Start Of Frame (SOF) token.\n
In Host mode this field is set when the SOF threshold is reached, so that software can prepare for the next SOF</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>TOKDNE</name> <description>Token Done\n
This bit is set when the current token being processed has completed.\n
The processor should immediately read the STAT register to determine the EndPoint and BD used for this token.\n
Clearing this bit (by writing a one) causes the STAT register to be cleared or the STAT holding register to be loaded into the STAT Register</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>SLEEP</name> <description>Sleep timer\n
This bit is set when the USB Module detects a constant idle on the USB bus for 3 ms.\n
The sleep timer is reset by activity on the USB bus</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>RESUME</name> <description>Resume detect\n
This bit is set depending upon the DP/DM signals, and can be used to signal remote wake-up signaling on the USB bus.\n
When not in suspend mode this interrupt must be disabled</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>ATTACH</name> <description>Attach detect\nAttach Interrupt</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="USBRST" > <name>STALL</name> <description>Stall detected\nStall Interrupt</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>INTEN</name>
               <description>Interrupt Enable Register\n
The Interrupt Enable Register contains enable bits for each of the interrupt sources within the USB Module.\n
Setting any of these bits enables the respective interrupt source in the INT_STAT register</description>
               <addressOffset>0x84</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>USBRSTEN</name>
                     <description>USBRST Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="USBRSTEN" > <name>ERROREN</name> <description>ERROR Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>SOFTOKEN</name> <description>SOFTOK Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>TOKDNEEN</name> <description>TOKDNE Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>SLEEPEN</name> <description>SLEEP Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>RESUMEEN</name> <description>RESUME Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>ATTACHEN</name> <description>ATTACH Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="USBRSTEN" > <name>STALLEN</name> <description>STALL Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ERRSTAT</name>
               <description>Error Interrupt Status Register\n
The Error Interrupt Status Register contains enable bits for each of the error sources within the USB Module.\n
Each of these bits are qualified with their respective error enable bits</description>
               <addressOffset>0x88</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PIDERR</name>
                     <description>PID Error\nThis bit is set when the PID check field fails</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PIDERR" > <name>CRC5EOF</name> <description>CRC5EOF Error\n
This error interrupt has two functions:
 - When the USB Module is operating in peripheral mode (HOSTMODEEN=0), this interrupt detects CRC5 errors in the token packets generated by the host.
   If set the token packet was rejected due to a CRC5 error. 
 - When the USB Module is operating in host mode (HOSTMODEEN=1), this interrupt detects End Of Frame (EOF) error conditions. 
   This occurs when the USB Module is transmitting or receiving data and the SOF counter reaches zero</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>CRC16</name> <description>CRC16 Error\n
This bit is set when a data packet is rejected due to a CRC16 error</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>DFN8</name> <description>Data field length invalid\n
This bit is set if the data field received was not 8 bits in length</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>BTOERR</name> <description>Bus Turnaround Error\n
This bit is set when a bus turnaround timeout error occurs.\n
The USB module contains a bus turnaround timer that keeps track of the amount of time elapsed between the token and data phases of a SETUP or OUT TOKEN or the data and handshake phases of a IN TOKEN. If more than 16 bit times are counted from the previous EOP before a transition from IDLE, a bus turnaround timeout error occurs</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>DMAERR</name> <description>DMA Error\n
This bit is set if the USB Module has requested a DMA access to read a new BDT but has not been given the bus before it needs to receive or transmit data. If processing a TX transfer this would cause a transmit data underflow condition. If processing a RX transfer this would cause a receive data overflow condition. This interrupt is useful when developing device arbitration hardware for the microprocessor and the USB Module to minimize bus request and bus grant latency. This bit is also set if a data packet to or from the host is larger than the buffer size allocated in the BDT. In this case the data packet is truncated as it is put into buffer memory</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>OWNERR</name> <description>USB Mode\n
This field is valid when the USB Module is operating in peripheral mode (CTL[HOSTMODEEN]=0)</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PIDERR" > <name>BTSERR</name> <description>Bit Stuff Error\n
This bit is set when a bit stuff error is detected. If set, the corresponding packet is rejected due to the error</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
