podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USB0_MKL82Z7.svd.xml
            <register>
               <name>CLK_RECOVER_INT_STATUS</name>
               <description>Clock recovery separated interrupt status\n
A Write operation with value high at 1&apos;b1 on any combination of individual bits 
will clear those bits</description>
               <addressOffset>0x15C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OVF_ERROR</name>
                     <description>Indicates that the USB clock recovery algorithm has detected 
that the frequency trim adjustment needed for the IRC48M output clock is outside the available 
TRIM_FINE adjustment range for the IRC48M module</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt is reported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Unmasked interrupt has been generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
